tutorials/compressible/nexaFoam/heatBath_N2N_reaction/0/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      initialConditions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

TTRValue  30000;
TVibValue 1000;

pressureValue  41419.4;

velocityValue  (0 0 0);

N2_mol_fraction 0.5;
N_mol_fraction 0.5;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
