tutorials/compressible/nexaFoam/heatBath_N2N_reaction/constant/reactionsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      reactionsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

elements
(
    N
);


species
(
    N2
    N
);

reactions
{
    N2dissociation
    {
        type     irreversibleneArrheniusneReaction;
        reaction "N2 + N2 = 2N + N2";
        A        7e21;
        beta     -1.60;
        Ta       113200;
        alphaPark  0.7;
    }
    /*methaneReaction
    {
        type     irreversibleArrheniusReaction;
        reaction "CH4 + 2O2 = CO2 + 2H2O";
        A        5.2e16;
        beta     0;
        Ta       14906;
    }*/
}
